tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "bob"
brew "cloud-sql-proxy"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "kubernetes-cli"
brew "lazygit"
brew "mise"
brew "neofetch"
brew "redis"
brew "ripgrep"
brew "starship"
brew "switchaudio-osx"
brew "tmux"
brew "tpm"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "android-studio"
cask "betterdisplay"
cask "bruno"
cask "dbeaver-community"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "intellij-idea"
cask "logi-options+"
cask "mongodb-compass"
cask "slack"
cask "steermouse"
cask "visual-studio-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
