tap "felixkratz/formulae"
tap "nikitabobko/tap"

# Core
brew "git"
brew "stow"
brew "wget"
brew "gh"

# Shell
brew "zsh"
brew "starship"
brew "fzf"
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "mise"

# Terminal / multiplexer
brew "tmux"
brew "tpm"

# Editor / dev
brew "bob"           # neovim version manager
brew "tree-sitter"
brew "lazygit"

# System / monitoring
brew "btop"
brew "bottom"
brew "fastfetch"
brew "gdu"

# Media / misc
# brew "vips"
# brew "ghostscript"
# brew "mermaid-cli"
# brew "tectonic"
# brew "switchaudio-osx"
# brew "felixkratz/formulae/sketchybar"

# Containers / infra
# brew "kubernetes-cli"
# brew "redis"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Apps
cask "aerospace"
# cask "android-studio"
cask "betterdisplay"
# cask "bruno"
cask "dbeaver-community"
# cask "firefox"
cask "ghostty"
# cask "google-chrome"
# cask "intellij-idea"
# cask "intellij-idea-ce"
# cask "logi-options+"
# cask "mongodb-compass"
# cask "slack"
cask "steermouse"
# cask "visual-studio-code"

# VS Code extensions
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "redhat.java"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "vscjava.vscode-gradle"
# vscode "vscjava.vscode-java-debug"
# vscode "vscjava.vscode-java-dependency"
# vscode "vscjava.vscode-java-pack"
# vscode "vscjava.vscode-java-test"
# vscode "vscjava.vscode-maven"
# vscode "vscodevim.vim"
