tap "felixkratz/formulae"
tap "nikitabobko/tap"
brew "bob"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "mise"
brew "neofetch"
brew "ripgrep"
brew "starship"
brew "switchaudio-osx"
brew "tmux"
brew "tpm"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "android-studio"
cask "bruno"
cask "dbeaver-community"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "intellij-idea"
cask "slack"
cask "visual-studio-code"
